emacs/alt-Configs/MarinMacsHelm.org
#+TITLE: MarinMacs Configuration 
#+AUTHOR: Marin P. Marinov  
#+EMAIL: marin.marinov@macaulay.cuny.edu
#+LANGUAGE: en
#+TAGS: Emacs
#+DESCRIPTION: My emacs config for software development
This file is part of my [[https://github.com/marinov98/dotfiles][dotfiles repository]]

* Table of Contents :TOC_3:
- [[#general-settings][General Settings]]
- [[#quelpa][Quelpa]]
- [[#evil-mode][Evil-mode]]
- [[#markup][Markup]]
- [[#dashboard][Dashboard]]
- [[#themes][Themes]]
- [[#modeline][Modeline]]
- [[#enhancements][Emacs Enhancements]]
  - [[#avy][Avy]]
  - [[#which-key][Which-Key]]
  - [[#ace-window][Ace-Window]]
  - [[#ranger][Ranger]]
  - [[#all-the-icons][All-the-icons]]
  - [[#beacon][Beacon]]
  - [[#neotree][neotree]]
- [[#helm][Helm]]
- [[#projectile][Projectile]]
- [[#shell][Shell]]
- [[#globals][Globals]]
  - [[#undo-tree][Undo Tree]]
  - [[#Yasnippet][Yasnippet]]
  - [[#flycheck][Flycheck]]
  - [[#company][Company]]
- [[#git][Git]]
- [[#hydra][Hydra]]
- [[#lsp][Language Server Protocal (lsp)]]
- [[#dap][Debug Adapter Protocal (dap)]]
- [[#latex][Latex]]
- [[#development][Development]]
  - [[#c-cpp][C/C++]]
  - [[#python][Python]]
  - [[#JavaScript-TypeScript][JavaScript/TypeScript]]
- [[#diminish][Diminish]]

* General Settings 
 :PROPERTIES:
 :CUSTOM_ID: general-settings
 :END:
** Preferences
Indentation 
#+BEGIN_SRC emacs-lisp
    (setq-default indent-tabs-mode nil)                    ;; disable tabs and use spaces
    (setq-default tab-width 4)                             ;; set default tab width 4 
    (setq backward-delete-char-untabify-method 'hungry)    ;; backspaces entire tab instead of one space at a time
#+END_SRC
- Options, display, parenthesis 
- I like to use [[https://github.com/tonsky/FiraCode][Fira Code]] font
#+BEGIN_SRC emacs-lisp
  (setq default-frame-alist '((font . "Fira Code-12")
                              (cursor-color . "#ffc600"))) ;; set font, font size, and cursor color
  (setq visible-bell t)                                    ;; disable end of buffer sounds
  (electric-pair-mode)                                     ;; auto closing brackets
  (show-paren-mode 1)                                      ;; highlight matching parenthesis
  (global-hl-line-mode 1)                                  ;; highlight current line 
  (setq inhibit-startup-screen t)                          ;; disable startup screen
#+END_SRC
- Line numbers
  - I am not sure if all packages work with line numbers properly, but so far everything works
  - relative line numbers are very useful when combined with vim bindings as they help you see how far you need to jump to get where you want to 
#+BEGIN_SRC emacs-lisp
    (when (version<= "26.0.50" emacs-version )         
      (setq display-line-numbers-type 'relative)           ;; relative line numbers help you see how far you need to jump to get where you want to 
      (setq display-line-numbers-current-absolute t)
      (setq display-line-numbers-width 2)
      (setq display-line-numbers-widen t)
      (global-display-line-numbers-mode))                  ;; display line numbers in every buffer
#+END_SRC
Displaying time and date in emacs
#+BEGIN_SRC emacs-lisp
    (setq display-time-24hr-format t)
    (display-time-mode 1)                                  ;; display time in the modeline
#+END_SRC
Convenient yes or no and disable bars/blinking cursor
#+BEGIN_SRC emacs-lisp
    (fset 'yes-or-no-p 'y-or-n-p)            ;; change yes or no to y or n
    (menu-bar-mode -1)                       ;; disable menu bar
    (toggle-scroll-bar -1)                   ;; disable scroll bar
    (tool-bar-mode -1)                       ;; disable tool bar
    (blink-cursor-mode -1)                   ;; make cursor stop blinking
#+END_SRC
Disable back up files (comment if you want to enable backup files) 
#+BEGIN_SRC emacs-lisp
    (setq make-backup-files nil)             ;; stop creating backup~ files
    (setq auto-save-default nil)             ;; stop creating autosave# files
    (setq create-lockfiles nil)              ;; stop creating any # files
#+END_SRC
Emacs has native support for the GNU Debugger (GDB), and we can make it a little better
#+BEGIN_SRC emacs-lisp
    (setq gdb-many-windows t)                ;; have multiple windows when debugging
    (setq gdb-show-main t)                   ;; Non-nil means display source file containing the main routine at startup
#+END_SRC
** Goto Config
A nice and quick way to view/edit my configuration at any time
  #+begin_src emacs-lisp
    (defun goto-MarinMacs ()
      "Jump to configuration file"
      (interactive)
      (find-file "~/.emacs.d/MarinMacs.org")) 
    (global-set-key (kbd "C-c m") 'goto-MarinMacs) ;; secondary binding is SPC m m 
  #+end_src
* Quelpa
 :PROPERTIES:
 :CUSTOM_ID: quelpa
 :END:
'Build and install your Emacs Lisp packages on-the-fly and directly from source.'
#+BEGIN_SRC emacs-lisp
(use-package quelpa-use-package
    :ensure t)
#+END_SRC
* Evil-Mode
 :PROPERTIES:
 :CUSTOM_ID: evil-mode
 :END:
 - Packages needed to emulate vim inside Emacs. 
 - Make sure you have [[#undo-tree][undo-tree]] package installed 
 - I have mapped my caps lock to both esc and ctrl to utilize both vim and emacs bindings
 - I placed all the evil packages here so that if this section gets deleted any alias to evil mode will be gone
** Essentials
 - Evil mode grants us vim bindings and evil-leader allows us to create a <leader> key which creates limitless possibilities for keybindings
 - Official repository for Evil Mode: https://github.com/emacs-evil/evil
 - Evil Leader repository: https://github.com/cofi/evil-leader 
#+BEGIN_SRC emacs-lisp
  (use-package evil-leader
      :ensure t
      :config
      (global-evil-leader-mode t)
      (evil-leader/set-leader "<SPC>")
      (evil-leader/set-key
        ;; hydras
        "SPC" 'hydra-projectile/body
        "w" 'hydra-window/body
        "z" 'hydra-zoom/body
        "l" 'hydra-lsp/body
        "d" 'hydra-describe/body
        "g" 'hydra-git/body
        "TAB" 'hydra-launcher/body
        "v" 'hydra-writing/body
        "u" 'hydra-utility/body
        "a" 'hydra-avy/body
        "r" 'hydra-org/body
        ;; file finding, coding, searching, and yanking
        "f" 'helm-find-files
        "j" 'helm-browse-project ;; need git installed!
        "i" 'helm-swoop-without-pre-input ;; think of it as isearch's cousin to remember keybinding 
        "m" 'helm-multi-swoop
        "*" 'helm-swoop
        "y" 'helm-show-kill-ring
        "c" 'avy-goto-char-timer
        "x" 'helm-M-x
        ;; buffers
        "s" 'save-buffer
        "b" 'helm-mini
        "p" 'switch-to-prev-buffer
        "n" 'switch-to-next-buffer
        "C" 'comment-region
        ;; deletion
        "q" 'delete-window
        "Q" 'save-buffers-kill-terminal
        "k" 'kill-current-buffer
        "K" 'kill-buffer
        "o" 'delete-other-windows
        ;; package-specific
        "t" 'neotree-toggle))

  (use-package evil
      :ensure t
      :config
      (evil-mode 1)
      ;; make switching windows much easier
      (define-key evil-motion-state-map (kbd "M-h") 'evil-window-left)
      (define-key evil-motion-state-map (kbd "M-j") 'evil-window-down)
      (define-key evil-motion-state-map (kbd "M-k") 'evil-window-up)
      (define-key evil-motion-state-map (kbd "M-l") 'evil-window-right)
      ; NeoTree override keybindings, package (neotree) is shown further in the config
      (evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
      (evil-define-key 'normal neotree-mode-map (kbd "SPC") 'neotree-quick-look)
      (evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
      (evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter)
      (evil-define-key 'normal neotree-mode-map (kbd "g") 'neotree-refresh)
      (evil-define-key 'normal neotree-mode-map (kbd "n") 'neotree-next-line)
      (evil-define-key 'normal neotree-mode-map (kbd "p") 'neotree-previous-line)
      (evil-define-key 'normal neotree-mode-map (kbd "A") 'neotree-stretch-toggle)
      (evil-define-key 'normal neotree-mode-map (kbd "H") 'neotree-hidden-file-toggle))

#+END_SRC
** Evil utility 
- Below evil packages are extras that enhance the evil-mode experience in emacs
#+BEGIN_SRC emacs-lisp
  ;; like tpope's vim-surround
  (use-package evil-surround
      :ensure t
      :config
      (global-evil-surround-mode 1))

  ;; Evil multiple-cursors
  (use-package evil-mc
      :ensure t
      :diminish
      :config
      (global-evil-mc-mode 1))


  ;; Evil magit overrides magit keybindings, package (magit) is shown further in the config
  (use-package evil-magit :ensure t)
#+END_SRC
* Markup
 :PROPERTIES:
 :CUSTOM_ID: markup
 :END:
** Org
 - 'Org mode is for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system.'  
 - Org manual: https://orgmode.org/
#+BEGIN_SRC emacs-lisp
  (use-package org 
      :ensure t
      :pin org)
     
 ;; allow easier snippet insertion  
 (require 'org-tempo)
 
  ;; bullets
  (use-package org-bullets
     :ensure t
     :config
     (add-hook 'org-mode-hook (lambda() (org-bullets-mode 1))))

  ;; Org custom settings
  (custom-set-variables
           '(org-directory "~/Projects/org")
           '(org-default-notes-file (concat org-directory "/Personal/notes.org")))

#+END_SRC
** Markdown
#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
      :ensure t
      :commands markdown-mode
      :mode
      ("\\.\\(md\\|markdown\\)\\'" . markdown-mode))
#+END_SRC
