emacs/backups/MarinMacsHelm.el
(setq-default indent-tabs-mode nil)                    ;; disable tabs and use spaces
(setq-default tab-width 4)                             ;; set default tab width 4 
(setq backward-delete-char-untabify-method 'hungry)    ;; backspaces entire tab instead of one space at a time

(setq default-frame-alist '((font . "Fira Code-12")
                            (cursor-color . "#ffc600"))) ;; set font, font size, and cursor color
(setq visible-bell t)                                    ;; disable end of buffer sounds
(electric-pair-mode)                                     ;; auto closing brackets
(show-paren-mode 1)                                      ;; highlight matching parenthesis
(global-hl-line-mode 1)                                  ;; highlight current line 
(setq inhibit-startup-screen t)                          ;; disable startup screen

(when (version<= "26.0.50" emacs-version )         
  (setq display-line-numbers-type 'relative)           ;; relative line numbers help you see how far you need to jump to get where you want to 
  (setq display-line-numbers-current-absolute t)
  (setq display-line-numbers-width 2)
  (setq display-line-numbers-widen t)
  (global-display-line-numbers-mode))                  ;; display line numbers in every buffer

(setq display-time-24hr-format t)
(display-time-mode 1)                                  ;; display time in the modeline

(fset 'yes-or-no-p 'y-or-n-p)            ;; change yes or no to y or n
(menu-bar-mode -1)                       ;; disable menu bar
(toggle-scroll-bar -1)                   ;; disable scroll bar
(tool-bar-mode -1)                       ;; disable tool bar
(blink-cursor-mode -1)                   ;; make cursor stop blinking

(setq make-backup-files nil)             ;; stop creating backup~ files
(setq auto-save-default nil)             ;; stop creating autosave# files
(setq create-lockfiles nil)              ;; stop creating any # files

(setq gdb-many-windows t)                ;; have multiple windows when debugging
(setq gdb-show-main t)                   ;; Non-nil means display source file containing the main routine at startup

(defun goto-MarinMacs ()
  "Jump to configuration file"
  (interactive)
  (find-file "~/.emacs.d/MarinMacs.org")) 
(global-set-key (kbd "C-c m") 'goto-MarinMacs) ;; secondary binding is SPC m m

(use-package quelpa-use-package
    :ensure t)

(use-package evil-leader
    :ensure t
    :config
    (global-evil-leader-mode t)
    (evil-leader/set-leader "<SPC>")
    (evil-leader/set-key
      ;; hydras
      "SPC" 'hydra-projectile/body
      "w" 'hydra-window/body
      "z" 'hydra-zoom/body
      "l" 'hydra-lsp/body
      "d" 'hydra-describe/body
      "g" 'hydra-git/body
      "TAB" 'hydra-launcher/body
      "v" 'hydra-writing/body
      "m" 'hydra-utility/body
      "a" 'hydra-avy/body
      "r" 'hydra-org/body
      ;; file finding, searching, and yanking
      "f" 'helm-find-files
      "j" 'helm-browse-project ;; need git installed!
      "i" 'swiper-helm
      "I" 'swiper-multi
      "S" 'swiper-thing-at-point
      "y" 'helm-show-kill-ring
      "c" 'avy-goto-char-timer
      "x" 'helm-M-x
      ;; buffers
      "s" 'save-buffer
      "b" 'helm-mini
      "p" 'switch-to-prev-buffer
      "n" 'switch-to-next-buffer
      "/" 'comment-region
      ;; deletion
      "q" 'delete-window
      "Q" 'save-buffers-kill-terminal
      "k" 'kill-current-buffer
	  "K" 'kill-buffer
      "o" 'delete-other-windows
      ;; package-specific
      "t" 'neotree-toggle
      "h s" 'helm-swoop
      "h a" 'helm-multi-swoop))

(use-package evil
    :ensure t
    :config
    (evil-mode 1)
    ;; make switching windows much easier
    (define-key evil-motion-state-map (kbd "M-h") 'evil-window-left)
    (define-key evil-motion-state-map (kbd "M-j") 'evil-window-down)
    (define-key evil-motion-state-map (kbd "M-k") 'evil-window-up)
    (define-key evil-motion-state-map (kbd "M-l") 'evil-window-right)
    ; NeoTree override keybindings, package (neotree) is shown further in the config
    (evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "SPC") 'neotree-quick-look)
    (evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
    (evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "g") 'neotree-refresh)
    (evil-define-key 'normal neotree-mode-map (kbd "n") 'neotree-next-line)
    (evil-define-key 'normal neotree-mode-map (kbd "p") 'neotree-previous-line)
    (evil-define-key 'normal neotree-mode-map (kbd "A") 'neotree-stretch-toggle)
    (evil-define-key 'normal neotree-mode-map (kbd "H") 'neotree-hidden-file-toggle))

;; like tpope's vim-surround
(use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))

;; Evil multiple-cursors
(use-package evil-mc
    :ensure t
    :diminish
    :config
    (global-evil-mc-mode 1))


;; Evil magit overrides magit keybindings, package (magit) is shown further in the config
(use-package evil-magit :ensure t)

(use-package org 
     :ensure t
     :pin org)

;; allow easier snippet insertion  
(require 'org-tempo)

 ;; bullets
 (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda() (org-bullets-mode 1))))

 ;; Org custom settings
 (custom-set-variables
          '(org-directory "~/Projects/org")
          '(org-default-notes-file (concat org-directory "/Personal/notes.org")))

(use-package markdown-mode
    :ensure t
    :commands markdown-mode
    :mode
    ("\\.\\(md\\|markdown\\)\\'" . markdown-mode))
