emacs/alt-Configs/MarinMacsHelm.org
** Writing
 :PROPERTIES:
 :CUSTOM_ID: writing
 :END:
  - flyspell (checking spelling on the fly)
  - wc-mode (word counter)
  - writegood-mode (sentence/word choice checker)
#+BEGIN_SRC emacs-lisp
  (use-package flyspell
      :ensure t
      :commands (ispell-change-dictionary
                 ispell-word
                 flyspell-buffer
                 flyspell-mode
                 flyspell-region)
      :bind
      (:map flyspell-mode-map
      ("C-M-i" . nil))) ;; messes with org autocomplete

  (use-package wc-mode
      :ensure t
      :commands wc-mode
      :config
      (global-set-key "\C-cw" 'wc-mode))

  (use-package writegood-mode
      :ensure t
      :commands writegood-mode
      :bind ("C-x w" . writegood-mode)) ;; messes with org snippets dont enable by default in org

#+END_SRC
* Dashboard 
 :PROPERTIES:
 :CUSTOM_ID: dashboard
 :END:
- This package is displayed when you start up emacs without selecting a file. 
- Prerequisites: https://github.com/cask/cask
- After installing cask, learn how to customize the dashboard by going here: https://github.com/emacs-dashboard/emacs-dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard 
      :ensure t
      :custom
      (dashboard-banner-logo-title "MarinMacs")
      (dashboard-set-heading-icons t)
      (dashboard-set-init-info t)
      (dashboard-set-file-icons t)
      (dashboard-set-navigator t)
      (dashboard-startup-banner 'logo)
      (dashboard-footer-messages '("Maintained by Marin P. Marinov since 2018"))
      :config
      (dashboard-setup-startup-hook)
      (setq dashboard-items '((recents  . 5)
                             (bookmarks . 5)
                             (agenda . 5)
                             (projects . 5))))
#+END_SRC
* Themes
 :PROPERTIES:
 :CUSTOM_ID: themes
 :END:
** Favorite-Themes
*** Colorful and visually pleasing    
- Spacemacs-theme
- Zerodark
- Doom-one
- modus-vivendi (amazing color contrast)
*** Easy on the eyes
- doom-gruvbox
- doom-solarized-dark
- doom-nord
- Zenburn
- JellyBeans 
- Planet
*** For Org and any Markdown Language
- Poet
** Customization
You can enable/disable any themes that you like here
#+BEGIN_SRC emacs-lisp
    ;; BE AWARE: emacs can have multiple themes on at the same time
    ;; Multiple themes can mix into a super theme
    ;; Some themes do not mix well which is why I disable themes

     (use-package spacemacs-common
         :disabled
         :ensure spacemacs-theme
         :config (load-theme 'spacemacs-dark t))

     (use-package doom-themes
         :ensure t 
         :custom
         (doom-themes-enable-bold t)
         (doom-themes-enable-italic t)
         :config
         (load-theme 'doom-one t)
         (doom-themes-visual-bell-config) ;; Enable flashing mode-line on errors
         (doom-themes-org-config)) ;; Corrects (and improves) org-mode's native fontification.

     (use-package zerodark-theme
         :disabled
         :ensure t)

     (use-package minimal-theme
         :disabled
         :ensure t
         :config
         (load-theme 'minimal t))

     (use-package zenburn-theme
         :disabled
         :ensure t
         :config
         (load-theme 'zenburn t))

     (use-package poet-theme
         :disabled
         :ensure t)

     (use-package modus-vivendi-theme
         :disabled
         :ensure t
         :config
         (setq modus-vivendi-theme-bold-constructs t)
         (load-theme 'modus-vivendi t))

     (use-package modus-operandi-theme
         :disabled
         :ensure t
         :config (load-theme 'modus-operandi t))

     (use-package jbeans-theme
         :disabled
         :ensure t
         :config
         (load-theme 'jbeans t))

     (use-package planet-theme
         :disabled
         :ensure t
         :config 
         (load-theme 'planet t))
#+END_SRC
* Modeline
 :PROPERTIES:
 :CUSTOM_ID: modeline
 :END:
- The modeline is at the bottom of the window, it describes what is going on in the current buffer
  - it can display modes, time, filenames, and even line numbers
- You can pick one of these modeline themes, simply enable the one you want to try and disable the rest
#+BEGIN_SRC emacs-lisp

  ;;;;;;;;;;;;;;;;;;;;;;   
  ;; Spaceline
  ;;;;;;;;;;;;;;;;;;;;;;   

  (use-package spaceline
      :ensure t
      :custom-face
      (spaceline-highlight-face ((t (:background "#ffc600" :foreground "black"))))
      :custom
      (spaceline-toggle-flycheck-info-off)
      :config
      (require 'spaceline-config)
      (setq powerline-default-separator (quote arrow))
      (spaceline-highlight-face-default) 
      (spaceline-spacemacs-theme))

  ;;;;;;;;;;;;;;;;;;;;;;   
  ;;  Telephone-line
  ;;;;;;;;;;;;;;;;;;;;;;   
   
    (use-package telephone-line
        :disabled  
        :ensure t
        :config
        (setq telephone-line-lhs
        '((evil   . (telephone-line-evil-tag-segment))
          (accent . (telephone-line-vc-segment
                     telephone-line-erc-modified-channels-segment
                     telephone-line-process-segment))
          (nil    . (telephone-line-minor-mode-segment
                     telephone-line-buffer-segment))))
        (setq telephone-line-rhs
        '((nil    . (telephone-line-misc-info-segment))
          (accent . (telephone-line-major-mode-segment))
          (evil   . (telephone-line-airline-position-segment))))
          (telephone-line-mode 1))
    
  ;;;;;;;;;;;;;;;;;;;;;;   
  ;; lightweight doom theme
  ;;;;;;;;;;;;;;;;;;;;;;   

    (use-package doom-modeline
        :disabled
        :ensure t
        :hook (after-init . doom-modeline-mode))

#+END_SRC
* Helm
 :PROPERTIES:
 :CUSTOM_ID: helm
 :END:
- I cant lie, I didn't think I would love helm's interface as much as I like ivy's but hey you never know until you try (I think it's also because of the doom-one theme...)
- =Helm= is an Emacs framework for incremental completions and narrowing selections. Probably the heaviest with the most features
  - Other completion frameworks include ivy (lighter), ido (native to Emacs)
- Official site: https://emacs-helm.github.io/helm/
- Helm-ag: uses silversearcher with helm frontend to find matches (but you can force it to use ripgrep like I did)
  - This because helm-rg has not been working properly and I prefer a consistant interface rather than resort to packages like deadgrep or rg
  - Based on my experience and online sources ripgrep finds matches much faster than ag, which itself is praised for its speed
- Helm-ls-git: provides =helm-browse-projects= which allows you search following your gitignore
- Helm-swoop: listing line matches (similiar to swiper and isearch)
  #+begin_src emacs-lisp
    (use-package helm
        :ensure t
        :diminish
        :custom
        (helm-split-window-inside-p t)
        (helm-move-to-line-cycle-in-source t)
        (helm-autoresize-max-height 0)
        (helm-autoresize-min-height 20)
        (helm-M-x-fuzzy-match t)
        (helm-buffers-fuzzy-matching t)
        (helm-recentf-fuzzy-match t)
        (helm-semantic-fuzzy-match t)
        (helm-imenu-fuzzy-match t)
        :bind
        (("M-x" . helm-M-x)
        ("C-x C-f" . helm-find-files)
        ("M-y" . helm-show-kill-ring)
        ("C-x b" . helm-mini)
        :map helm-map
        ("TAB" . helm-execute-persistent-action)
        ("<tab>" . helm-execute-persistent-action)
        ("C-z" . helm-select-action)
        ("M-S-j" . helm-next-source)
        ("M-S-k" . helm-previous-source)
        ("M-j" . helm-next-line)
        ("M-k" . helm-previous-line))
        :config
        (require 'helm-config)
        (helm-mode 1)
        (helm-autoresize-mode 1))

     (use-package helm-ag
         :after helm
         :custom
         (helm-ag-base-command "rg --vimgrep --no-heading --smart-case") ;; force use of ripgrep
         :ensure t)
         
     (use-package helm-ls-git 
         :after helm
         :ensure t)

     (use-package helm-swoop
         :after helm
         :ensure t
         :bind
         (("C-s" . helm-swoop-without-pre-input)
         :map helm-swoop-map
         ("M-j" . helm-next-line)
         ("M-k" . helm-previous-line)
         :map helm-multi-swoop-map
         ("M-j" . helm-next-line)
         ("M-k" . helm-previous-line))
         :custom
         (helm-swoop-split-with-multiple-windows nil)
         (helm-swoop-split-direction 'split-window-vertically)
         (helm-swoop-speed-or-color nil)
         (helm-swoop-move-to-line-cycle t)
         (helm-swoop-use-line-number-face t)
         (helm-swoop-use-fuzzy-match t))
  #+end_src
* Enhancements 
 :PROPERTIES:
 :CUSTOM_ID: enhancements
 :END:
** Avy
 :PROPERTIES:
 :CUSTOM_ID: avy
 :END:
 I did not think anything of this package until I actively used it in my workflow. This package proved to be nothing but amazing for jumping around text. Its inspiration comes from 
the vim package =easymotion=. This package really boosts your ability to fly around text even with the already fast motion vim keybindings. I utilize the keybindings in a hydra and 
a personal keybinding just because its so good. Check the [[https://github.com/abo-abo/avy][official repository]] If you want to know more. 
#+BEGIN_SRC emacs-lisp
  (use-package avy 
      :ensure t
      :custom
      (avy-timeout-seconds 0.3))
#+END_SRC
** Which-Key
 :PROPERTIES:
 :CUSTOM_ID: which-key
 :END:
 A cheat sheet that comes in only when you need it
#+BEGIN_SRC emacs-lisp
(use-package which-key
	:ensure t 
    :diminish
	:config
	(which-key-mode))
#+END_SRC
** Ace-Window
 :PROPERTIES:
 :CUSTOM_ID: ace-window
 :END:
Useful if you work on multiple windows and want an efficient way of switching between them
#+BEGIN_SRC emacs-lisp
(use-package ace-window
     :disabled
     :ensure t
     :init 
     (global-set-key (kbd "M-o") 'ace-window)
     (setq aw-background nil))
#+END_SRC
