emacs/backups/MarinMacsHelm.el

(use-package flyspell
    :ensure t
    :commands (ispell-change-dictionary
               ispell-word
               flyspell-buffer
               flyspell-mode
               flyspell-region)
    :bind
    (:map flyspell-mode-map
    ("C-M-i" . nil))) ;; messes with org autocomplete

(use-package wc-mode
    :ensure t
    :commands wc-mode
    :config
    (global-set-key "\C-cw" 'wc-mode))

(use-package writegood-mode
    :ensure t
    :commands writegood-mode
    :bind ("C-x w" . writegood-mode)) ;; messes with org snippets dont enable by default in org

(use-package dashboard 
    :ensure t
    :custom
    (dashboard-banner-logo-title "MarinMacs")
    (dashboard-set-heading-icons t)
    (dashboard-set-init-info t)
    (dashboard-set-file-icons t)
    (dashboard-set-navigator t)
    (dashboard-startup-banner 'logo)
    (dashboard-footer-messages '("Maintained by Marin P. Marinov since 2018"))
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-items '((recents  . 5)
                           (bookmarks . 5)
                           (agenda . 5)
                           (projects . 5))))

;; BE AWARE: emacs can have multiple themes on at the same time
;; Multiple themes can mix into a super theme
;; Some themes do not mix well which is why I disable themes

 (use-package spacemacs-common
     :disabled
     :ensure spacemacs-theme
     :config (load-theme 'spacemacs-dark t))

 (use-package doom-themes
     :ensure t 
     :custom
     (doom-themes-enable-bold t)
     (doom-themes-enable-italic t)
     :config
     (load-theme 'doom-one t)
     (doom-themes-visual-bell-config) ;; Enable flashing mode-line on errors
     (doom-themes-org-config)) ;; Corrects (and improves) org-mode's native fontification.

 (use-package zerodark-theme
     :disabled
     :ensure t)

 (use-package minimal-theme
     :disabled
     :ensure t
     :config
     (load-theme 'minimal t))

 (use-package zenburn-theme
     :disabled
     :ensure t
     :config
     (load-theme 'zenburn t))

 (use-package poet-theme
     :disabled
     :ensure t)

 (use-package modus-vivendi-theme
     :disabled
     :ensure t
     :config
     (setq modus-vivendi-theme-bold-constructs t)
     (load-theme 'modus-vivendi t))

 (use-package modus-operandi-theme
     :disabled
     :ensure t
     :config (load-theme 'modus-operandi t))

 (use-package jbeans-theme
     :disabled
     :ensure t
     :config
     (load-theme 'jbeans t))

 (use-package planet-theme
     :disabled
     :ensure t
     :config 
     (load-theme 'planet t))

;;;;;;;;;;;;;;;;;;;;;;   
;; Spaceline
;;;;;;;;;;;;;;;;;;;;;;   

(use-package spaceline
    :ensure t
    :custom-face
    (spaceline-highlight-face ((t (:background "#ffc600" :foreground "black"))))
    :custom
    (spaceline-toggle-flycheck-info-off)
    :config
    (require 'spaceline-config)
    (setq powerline-default-separator (quote arrow))
    (spaceline-highlight-face-default) 
    (spaceline-spacemacs-theme))

;;;;;;;;;;;;;;;;;;;;;;   
;;  Telephone-line
;;;;;;;;;;;;;;;;;;;;;;   

  (use-package telephone-line
      :disabled  
      :ensure t
      :config
      (setq telephone-line-lhs
      '((evil   . (telephone-line-evil-tag-segment))
        (accent . (telephone-line-vc-segment
                   telephone-line-erc-modified-channels-segment
                   telephone-line-process-segment))
        (nil    . (telephone-line-minor-mode-segment
                   telephone-line-buffer-segment))))
      (setq telephone-line-rhs
      '((nil    . (telephone-line-misc-info-segment))
        (accent . (telephone-line-major-mode-segment))
        (evil   . (telephone-line-airline-position-segment))))
        (telephone-line-mode 1))

;;;;;;;;;;;;;;;;;;;;;;   
;; lightweight doom theme
;;;;;;;;;;;;;;;;;;;;;;   

  (use-package doom-modeline
      :disabled
      :ensure t
      :hook (after-init . doom-modeline-mode))

(use-package helm
    :ensure t
    :diminish
    :custom
    (helm-split-window-inside-p t)
    (helm-move-to-line-cycle-in-source t)
    (helm-autoresize-max-height 0)
    (helm-autoresize-min-height 20)
    (helm-M-x-fuzzy-match t)
    (helm-buffers-fuzzy-matching t)
    (helm-recentf-fuzzy-match t)
    (helm-semantic-fuzzy-match t)
    :bind
    (("M-x" . helm-M-x)
    ("C-x C-f" . helm-find-files)
    ("M-y" . helm-show-kill-ring)
    ("C-x b" . helm-mini)
    :map helm-map
    ("TAB" . helm-execute-persistent-action)
    ("<tab>" . helm-execute-persistent-action)
    ("C-z" . helm-select-action)
    ("M-j" . helm-next-line)
    ("M-k" . helm-previous-line))
    :config
    (require 'helm-config)
    (helm-mode 1)
    (helm-autoresize-mode 1))

 ;; Swiper 
 (use-package swiper
     :ensure t
     :custom
     (swiper-action-recenter t)
     (swiper-goto-start-of-match t)
     (swiper-include-line-number-in-search t))


 (use-package swiper-helm
     :after (helm swiper)
     :ensure t
     :bind
     ("C-s" . swiper-helm))

 (use-package helm-rg 
     :after helm
     :ensure t
     :config (setq helm-rg-default-directory 'git-root))

 (use-package helm-ag
     :after helm
     :ensure t)

 (use-package helm-ls-git 
     :after helm
     :ensure t)

 (use-package helm-swoop
     :after helm
     :ensure t
     :custom
     (helm-swoop-split-with-multiple-windows nil)
     (helm-swoop-split-direction 'split-window-vertically)
     (helm-swoop-speed-or-color nil)
     (helm-swoop-move-to-line-cycle t)
     (helm-swoop-use-line-number-face t)
     (helm-swoop-use-fuzzy-match t))

(use-package fzf
    :ensure t)
  ;; :init
  ;; (setenv "FZF_DEFAULT_COMMAND" "fd --type f"))

(use-package avy 
    :ensure t
    :custom
    (avy-timeout-seconds 0.3))

(use-package which-key
	:ensure t 
    :diminish
	:config
	(which-key-mode))

(use-package ace-window
     :disabled
     :ensure t
     :init 
     (global-set-key (kbd "M-o") 'ace-window)
     (setq aw-background nil))

;; Ranger
