emacs/alt-Configs/MarinMacsHelm.org
** Ranger
 :PROPERTIES:
 :CUSTOM_ID: ranger
 :END:
 - An alternative to dired.
 - ranger file manager but in emacs, works the exact same way
 - Repo: https://github.com/ralesi/ranger.el
#+BEGIN_SRC emacs-lisp
  ;; Ranger
  (use-package ranger
     :ensure t
     :commands ranger
     :custom
     (ranger-parent-depth 1)
     (ranger-hide-cursor t)
     (ranger-show-hidden t)
     (ranger-preview-file t)
     (ranger-width-parents 0.2)
     (ranger-width-preview 0.50)
     (ranger-footer-delay 0.2)
     (ranger-preview-delay 0.040)
     :config
     (ranger-override-dired-mode t))

#+END_SRC
** All-The-Icons
 :PROPERTIES:
 :CUSTOM_ID: all-the-icons
 :END:
- This is where the file icons come from
- Make sure to run `M-x all-the-icons-install-fonts` if you want them to work!
- Repo: https://github.com/domtronn/all-the-icons.el
#+BEGIN_SRC emacs-lisp
    ;; Pretty Icons
  (use-package all-the-icons
      :ensure t)

  ;; icons for dired/ranger mode
  (use-package all-the-icons-dired
      :ensure t
      :after ranger
      :config
      (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
#+END_SRC
** Beacon 
 :PROPERTIES:
 :CUSTOM_ID: beacon
 :END:
I never lose where my cursor is thanks to this
#+BEGIN_SRC emacs-lisp
  (use-package beacon
      :ensure t
      :diminish
      :custom
      (beacon-color "#ffc600")
      :config
      (beacon-mode 1))
#+END_SRC
** Neotree
 :PROPERTIES:
 :CUSTOM_ID: neotree
 :END:
- 'A emacs tree plugin like NerdTree for Vim.'
- Amazing file browser. I do , however, want to test out treemacs one day 
- repo: https://github.com/jaypei/emacs-neotree
#+BEGIN_SRC emacs-lisp
  ;; Neotree
  (use-package neotree
      :ensure t
      :defer t
      :config 
      (setq neo-smart-open t) ; update every time its toggled
      (setq neo-theme (if (display-graphic-p) 'icons 'arrow))) ; add icons (utilizes all-the-icons)
#+END_SRC
* Projectile
 :PROPERTIES:
 :CUSTOM_ID: projectile
 :END:
- Amazing tool for managing projects! 
- Projectile Homepage: https://projectile.readthedocs.io/en/latest/ 
- Helm-Projectile: https://github.com/bbatsov/helm-projectile
#+BEGIN_SRC emacs-lisp
     ;; Projectile-mode 
    (use-package projectile
        :ensure t
        :bind 
        (("C-c p" . projectile-command-map))
        :custom 
        (projectile-project-search-path '("~/Projects/"))
        (projectile-sort-order 'recently-active)
        (projectile-completion-system 'helm)
        :config
        (projectile-mode t))

    (use-package helm-projectile 
        :ensure t
        :config
        (helm-projectile-on))
#+END_SRC
* Shell
 :PROPERTIES:
 :CUSTOM_ID: shell
 :END:
- exec-path-from-shell: https://github.com/purcell/exec-path-from-shell
- Eshell: https://www.gnu.org/software/emacs/manual/html_mono/eshell.html
   #+BEGIN_SRC emacs-lisp
       (use-package exec-path-from-shell
           :ensure t
           :config
           (when (memq window-system '(mac ns x)) ;; check if its mac
           (exec-path-from-shell-initialize)))

     ;; Eshell 
     ;; configuration found from this link: https://superuser.com/questions/890937/how-to-show-git-branch-in-emacs-shell
       (defun git-prompt-branch-name ()
           "Get current git branch name"
           (let ((args '("symbolic-ref" "HEAD" "--short")))
             (with-temp-buffer
               (apply #'process-file "git" nil (list t nil) nil args)
               (unless (bobp)
                 (goto-char (point-min))
                 (buffer-substring-no-properties (point) (line-end-position))))))

        (defun 4lex1v:eshell-prompt ()
           (let ((branch-name (git-prompt-branch-name)))
             (concat
              "\n# " (user-login-name) " in " (abbreviate-file-name (eshell/pwd)) "\n"
              (if branch-name (format "git:(%s) >> " branch-name) ">> ")
              )))         

        (setq eshell-prompt-function #'4lex1v:eshell-prompt
               eshell-prompt-regexp ".*>>+ ")
       (global-set-key (kbd "C-`") 'eshell) 
   #+END_SRC
* Globals
 :PROPERTIES:
 :CUSTOM_ID: globals
 :END:
 The below packages provide minor modes that will be enabled in every buffer (hence the global)
** Undo-Tree
 :PROPERTIES:
 :CUSTOM_ID: undo-tree
 :END:
 - You MUST have this for [[#evil-mode][Evil Mode]] to work
 - replaces Emacs' undo system with a system that treats undo history as what it is: a branching tree of changes. 
 - Even if you are using emacs without evil-mode, this package can prove useful
 - Documentation: https://elpa.gnu.org/packages/undo-tree.html
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
      :ensure t
      :diminish
      :init
      (global-undo-tree-mode))
#+END_SRC
** Yasnippet
 :PROPERTIES:
 :CUSTOM_ID: Yasnippet
 :END:
- all the packages related to snippets
- *YASnippet* is a template system for Emacs. It allows you to type an abbreviation and automatically expand it into function templates.
- I Remapped some bindings to make them work better with autocomplete
  - The new bindings are just as convenient if your caps lock is both esc and ctrl or even just ctrl
  - after some testing you can still actually use tab to insert snippets, but you will have to do it before company triggers
    - when company triggers, you can use Ctrl + Tab to insert a snippet
- repo: https://github.com/joaotavora/yasnippet
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
      :ensure t
      :bind 
      ((:map yas-keymap
      ("<tab>" . nil) ;; there are conflicts here with autocomplete
      ("<C-tab>" . yas-next-field-or-maybe-expand))
      (:map yas-minor-mode-map
      ("<tab>" . nil) ;; while this is convenient, it clashes with auto-complete and jump-to-definitions
      ("<C-tab>" . yas-expand)))
      :init
      (yas-global-mode 1)
      :config
      (yas-reload-all))

  (use-package yasnippet-snippets :ensure t)
    
  ;; snippets for React.js
  (use-package react-snippets
      :requires yasnippet
      :ensure t)
#+END_SRC 
** FlyCheck
 :PROPERTIES:
 :CUSTOM_ID: flycheck
 :END:
- Checking syntax on the fly...basically 
- Official Site: https://www.flycheck.org/en/latest/
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
       :ensure t
       :bind
       ("C-c f" . 'flycheck-buffer) ;; explicitly run flycheck
       :custom-face
       (flycheck-info ((t (:underline (:style line :color "#9500ff")))))
       (flycheck-warning ((t (:underline (:style line :color "#fbff00")))))
       (flycheck-error ((t (:underline (:style line :color "#ff0000")))))
       :custom
       (flycheck-check-syntax-automatically '(mode-enabled save)); run flycheck only on save
       :config
       (global-flycheck-mode t))
#+END_SRC
** Company
 :PROPERTIES:
 :CUSTOM_ID: company
 :END:
- This is one of the major completion engines in Emacs
- By itself it does not do much, you need to add backends to it for your specific development language to get autocomplete
- Official Site: http://company-mode.github.io/
#+BEGIN_SRC emacs-lisp
  (use-package company
      :ensure t
      :bind
      ("C-c c" . company-complete) ;; for when I need completion at 1 or 2 chars
      (:map company-active-map
      ("<tab>" . nil) ;; I will use this for a different purpose shown below
      ("M-n" . nil) ;; old select next key
      ("M-p" . nil) ;; old select prev key
      ("<tab>" . company-select-next) ;; make tab our new select next key
      ("M-j" . company-select-next)  ;; also make M-j new select next key
      ("M-k"  . company-select-previous))
      :custom
      (company-tooltip-limit 5) ; show 5 candidates at one time
      (company-idle-delay 0.15) ;; delay (in seconds) when candidates are shown, change if you need to, potentially cpu intensive on older machines if set to 0
      (company-minimum-prefix-length 3) ;; show completions after 3 chars
      (company-selection-wrap-around t) ;; goes to start of selection if you reached the bottom 
      (company-require-match 'never) ;; dont need to pick a choice 
      :config
      (global-company-mode t)) 
      
#+END_SRC 
Add Company backends to enable elisp autocomplete
#+BEGIN_SRC emacs-lisp

      ;; elisp autocomplete
      (defun my-elisp-mode-hook ()
      "Hook for `emacs-lisp-mode'"
      (set (make-local-variable 'company-backends)
      '((company-capf company-elisp company-dabbrev-code company-yasnippet company-files))))

      (add-hook 'emacs-lisp-mode-hook 'my-elisp-mode-hook)
      (add-hook 'emacs-lisp-mode-hook 'company-mode)
#+END_SRC
* Git
 :PROPERTIES:
 :CUSTOM_ID: git
 :END:
- [[https://magit.vc/][Magit]] is a great git interface I have yet to master...
- git-timemachine: flip through a file's full list of version. Revert to any given phase easily
#+BEGIN_SRC emacs-lisp
    ;; hydra takes care of my magit bindings
  (use-package magit :ensure t)
  
  (use-package git-commit
      :after magit
      :custom
      (git-commit-summary-max-length 50) ;; in accordance with https://chris.beams.io/posts/git-commit/
      :config
      (setq git-commit-style-convention-checks
            '(non-empty-second-line
            overlong-summary-line)))
            
  (use-package magit-repos
      :after magit
      :commands magit-list-repositories
      :custom
      (magit-repository-directories '(("~/Projects" . 1))))

  (use-package gitignore-mode
      :ensure t
      :mode (("\\.gitignore\\'" . gitignore-mode)
             ("\\.dockerignore\\'" . gitignore-mode))) ;; syntax from gitignore is more or less identical to that of .dockerignore

  (use-package gitconfig-mode
      :ensure t
      :mode "\\.gitconfig\\'")

  (use-package git-timemachine
      :ensure t
      :commands git-timemachine)

  ;; smerge mode deals with merge conflicts in git. Prefix mapping is C-c v
  (setq smerge-command-prefix "\C-cv")
#+END_SRC
