emacs/backups/MarinMacsHelm.el
(use-package ranger
   :ensure t
   :commands ranger
   :custom
   (ranger-parent-depth 1)
   (ranger-hide-cursor t)
   (ranger-show-hidden t)
   (ranger-preview-file t)
   (ranger-width-parents 0.2)
   (ranger-width-preview 0.50)
   (ranger-footer-delay 0.2)
   (ranger-preview-delay 0.040)
   :config
   (ranger-override-dired-mode t))

;; Pretty Icons
(use-package all-the-icons
    :ensure t)

;; icons for dired/ranger mode
(use-package all-the-icons-dired
    :ensure t
    :after ranger
    :config
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))

(use-package beacon
    :ensure t
    :diminish
    :custom
    (beacon-color "#ffc600")
    :config
    (beacon-mode 1))

;; Neotree
(use-package neotree
    :ensure t
    :defer t
    :config 
    (setq neo-smart-open t) ; update every time its toggled
    (setq neo-theme (if (display-graphic-p) 'icons 'arrow))) ; add icons (utilizes all-the-icons)

;; Projectile-mode 
(use-package projectile
    :ensure t
    :bind 
    (("C-c p" . projectile-command-map))
    :custom 
    (projectile-project-search-path '("~/Projects/"))
    (projectile-sort-order 'recently-active)
    (projectile-completion-system 'helm)
    :config
    (projectile-mode t))

(use-package helm-projectile 
    :ensure t
    :config
    (helm-projectile-on))

(use-package exec-path-from-shell
      :ensure t
      :config
      (when (memq window-system '(mac ns x)) ;; check if its mac
      (exec-path-from-shell-initialize)))

;; Eshell 
;; configuration found from this link: https://superuser.com/questions/890937/how-to-show-git-branch-in-emacs-shell
  (defun git-prompt-branch-name ()
      "Get current git branch name"
      (let ((args '("symbolic-ref" "HEAD" "--short")))
        (with-temp-buffer
          (apply #'process-file "git" nil (list t nil) nil args)
          (unless (bobp)
            (goto-char (point-min))
            (buffer-substring-no-properties (point) (line-end-position))))))

   (defun 4lex1v:eshell-prompt ()
      (let ((branch-name (git-prompt-branch-name)))
        (concat
         "\n# " (user-login-name) " in " (abbreviate-file-name (eshell/pwd)) "\n"
         (if branch-name (format "git:(%s) >> " branch-name) ">> ")
         )))         

   (setq eshell-prompt-function #'4lex1v:eshell-prompt
          eshell-prompt-regexp ".*>>+ ")
  (global-set-key (kbd "C-`") 'eshell)

(use-package undo-tree
    :ensure t
    :diminish
    :init
    (global-undo-tree-mode))

(use-package yasnippet
    :ensure t
    :bind 
    ((:map yas-keymap
    ("<tab>" . nil) ;; there are conflicts here with autocomplete
    ("<C-tab>" . yas-next-field-or-maybe-expand))
    (:map yas-minor-mode-map
    ("<tab>" . nil) ;; while this is convenient, it clashes with auto-complete and jump-to-definitions
    ("<C-tab>" . yas-expand)))
    :init
    (yas-global-mode 1)
    :config
    (yas-reload-all))

(use-package yasnippet-snippets :ensure t)

;; snippets for React.js
(use-package react-snippets
    :requires yasnippet
    :ensure t)

(use-package flycheck
     :ensure t
     :bind
     ("C-c f" . 'flycheck-buffer) ;; explicitly run flycheck
     :custom-face
     (flycheck-info ((t (:underline (:style line :color "#9500ff")))))
     (flycheck-warning ((t (:underline (:style line :color "#fbff00")))))
     (flycheck-error ((t (:underline (:style line :color "#ff0000")))))
     :custom
     (flycheck-check-syntax-automatically '(mode-enabled save)); run flycheck only on save
     :config
     (global-flycheck-mode t))

(use-package company
    :ensure t
    :bind
    ("C-c c" . company-complete) ;; for when I need completion at 1 or 2 chars
    (:map company-active-map
    ("<tab>" . nil) ;; I will use this for a different purpose shown below
    ("M-n" . nil) ;; old select next key
    ("M-p" . nil) ;; old select prev key
    ("<tab>" . company-select-next) ;; make tab our new select next key
    ("M-j" . company-select-next)  ;; also make M-j new select next key
    ("M-k"  . company-select-previous))
    :custom
    (company-tooltip-limit 5) ; show 5 candidates at one time
    (company-idle-delay 0.15) ;; delay (in seconds) when candidates are shown, change if you need to, potentially cpu intensive on older machines if set to 0
    (company-minimum-prefix-length 3) ;; show completions after 3 chars
    (company-selection-wrap-around t) ;; goes to start of selection if you reached the bottom 
    (company-require-match 'never) ;; dont need to pick a choice 
    :config
    (global-company-mode t))

;; elisp autocomplete
(defun my-elisp-mode-hook ()
"Hook for `emacs-lisp-mode'"
(set (make-local-variable 'company-backends)
'((company-capf company-elisp company-dabbrev-code company-yasnippet company-files))))

(add-hook 'emacs-lisp-mode-hook 'my-elisp-mode-hook)
(add-hook 'emacs-lisp-mode-hook 'company-mode)

;; hydra takes care of my magit bindings
(use-package magit :ensure t)

(use-package git-commit
    :after magit
    :custom
    (git-commit-summary-max-length 50) ;; in accordance with https://chris.beams.io/posts/git-commit/
    :config
    (setq git-commit-style-convention-checks
          '(non-empty-second-line
          overlong-summary-line)))

(use-package magit-repos
    :after magit
    :commands magit-list-repositories
    :custom
    (magit-repository-directories '(("~/Projects" . 1))))

(use-package gitignore-mode
    :ensure t
    :mode (("\\.gitignore\\'" . gitignore-mode)
           ("\\.dockerignore\\'" . gitignore-mode))) ;; syntax from gitignore is more or less identical to that of .dockerignore

(use-package gitconfig-mode
    :ensure t
    :mode "\\.gitconfig\\'")

(use-package git-timemachine
    :ensure t
    :commands git-timemachine)

;; smerge mode deals with merge conflicts in git. Prefix mapping is C-c v
(setq smerge-command-prefix "\C-cv")
