emacs/alt-Configs/MarinMacsHelm.org
* Hydra
 :PROPERTIES:
 :CUSTOM_ID: Hydra
 :END:
- You can go pretty crazy here, this package is one of my favorites
- Allows you set up your own key maps where pressing one key instantly gives access to many other keybindings
- Repo: https://github.com/abo-abo/hydra (Has a video demo)
#+BEGIN_SRC emacs-lisp
  (use-package hydra
      :ensure t
      :config
      (setq hydra-is-helpful t)
      (setq hydra-hint-display-type 'lv))
#+END_SRC
** Hydras
- Great hydras make for a great workflow (Let's hope they are great...)
- Customize as you see fit (colors affect hydra behavior!)
| color    | toggle                     |
|----------+----------------------------|
| red      |                            |
| blue     | :exit t                    |
| amaranth | :foreign-keys warn         |
| teal     | :foreign-keys warn :exit t |
| pink     | :foreign-keys run          |
*** Zoom (actually find this first one pretty useful)
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-zoom (:color pink)
    "zoom ðŸžˆ ðŸžˆ"
    ("k" text-scale-increase "in")
    ("j" text-scale-decrease "out")
    ("0" (text-scale-adjust 0) "reset")
    ("q" nil "quit" :color blue))

#+END_SRC
*** Describe (help describe anything and open up documentation)
#+BEGIN_SRC emacs-lisp
  ;; help
  (defhydra hydra-describe (:color red :columns 3)
    "Describe ðŸ¤“"
    ("a" helm-apropos "apropos")
    ("f" describe-function "func")
    ("F" describe-face "face")
    ("k" describe-key "key")
    ("v" describe-variable "var")
    ("p" describe-package "package")
    ("s" describe-symbol "symbol")
    ("m" which-key-show-major-mode "major mode")
    ("M" describe-mode "modes")
    ("t" describe-theme "theme")
    ("q" nil "quit" :color blue))

#+END_SRC
*** Projectile (project management)
Unlike with original Projectile, you need to launch first before using other commands
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-projectile (:color red :columns 3)
    "ðŸš€ Projectile ðŸš€"
    ("l" helm-projectile "launch")
    ("f" helm-projectile-find-file "find")
    ("o" helm-projectile-find-other-file "find other")
    ("w" helm-projectile-find-file-dwim "find-dwim")
    ("d" helm-projectile-find-dir "find-dir")
    ("g" helm-ag "ripgrep") ;; need ripgrep installed!
    ("s" helm-projectile-switch-project "switch project")
    ("b" helm-projectile-switch-to-buffer "buffer switch")
    ("r" projectile-recentf "recent files")
    ("k" projectile-kill-buffers "kill project buffers")
    ("q" nil "quit" :color blue))

#+END_SRC
*** Window (my attempt at window management)
#+BEGIN_SRC emacs-lisp
  ;; My attempt at window management
  (defhydra hydra-window (:color pink :columns 5)
   "âš¡âš¡ Helm + Windows âš¡âš¡"
    ("f" helm-find-files "find")
    ("b" helm-mini "switch buffer")
    ;; splitting
    ("o" delete-other-windows "delete other windows")
    ("2" split-window-right "v-split")
    ("3" split-window-below "h-split")
    ;; deletion and quitting
    ("K" kill-current-buffer "kill current buffer")
    ("d" delete-window "delete window")
    ("D" kill-this-buffer "kill buffer")
    ;; resizing
    ("s" shrink-window "shrink window")
    ("e" enlarge-window "enlarge window")
    ("S" shrink-window-horizontally "shrink horizontally")
    ("E" enlarge-window-horizontally "shrink horizontally")
    ("B" balance-windows "balance windows")
    ;; movement
    ("h" windmove-left "left")
    ("j" windmove-down "down")
    ("k" windmove-up "up")
    ("l" windmove-right "right")
    ("x" helm-M-x "M-x")
    ("q" nil "quit" :color blue))

#+END_SRC
*** Git (magit and timemachine)
#+BEGIN_SRC emacs-lisp
    ;; git 
    (defhydra hydra-git (:color red)
      "â³ Git â³"
      ("g" magit "magit")
      ("d" magit-dispatch "dispatch")
      ("l" magit-list-repositories "list repos")
      ("t" git-timemachine "timemachine")
      ("q" nil "quit" :color blue))
#+END_SRC
*** LSP (jump to definitions and references, list errors)
#+BEGIN_SRC emacs-lisp
  ;; lsp
  (defhydra hydra-lsp (:color red :columns 3)
    "ðŸ“¡ LSP ðŸ“¡"
    ("j" lsp-ui-peek-find-definitions "peek-def")
    ("r" lsp-ui-peek-find-references "peek-ref")
    ("c" lsp-rename "rename")
    ("f" lsp-find-definition "find-def")
    ("t" lsp-find-type-definition "find-type-def")
    ("e" flycheck-next-error "next error")
    ("p" flycheck-previous-error "prev error")
    ("l" lsp-ui-flycheck-list "list errors")
    ("b" switch-to-prev-buffer "back") ;; better consistancy than lsp-ui-peek-jump-backward
    ("n" switch-to-next-buffer "next") ;; better than lsp-ui-peek-jump-forward
    ("i" lsp-ui-imenu "imenu")
    ("q" nil "quit" :color blue))

#+END_SRC
*** Avy (jumping around text)
#+BEGIN_SRC emacs-lisp

  (defhydra hydra-avy (:color red :columns 3)
    "â†µ Avy â†µ"
    ("c" avy-goto-char "goto char")
    ("C" avy-goto-char-2 "goto char 2")
    ("t" avy-goto-char-timer "timed char")
    ("w" avy-goto-word-1 "goto word")
    ("W" avy-goto-word-0 "goto word 0")
    ("l" avy-goto-line "goto line")
    ("L" avy-goto-end-of-line "goto eoline")
    ("m" avy-move-line "move line")
    ("k" avy-kill-whole-line "kill line")
    ("y" avy-copy-line "yank line")
    ("r" avy-resume "resume")
    ("q" nil "quit" :color blue))
#+END_SRC
*** Launcher (launch stuff)
  #+BEGIN_SRC emacs-lisp
(setq
  browse-url-browser-function
  '(("https://www.netflix.com/" . browse-url-firefox) ;; firefox deals better with video players
  ("." . browse-url-chromium)))

     (defhydra hydra-launcher (:color red :columns 2)
      "ï© Launch ï©"
      ("h" man "man")
      ("g" (browse-url "https://www.google.com/") "Google")
      ("G" (browse-url "https://github.com/marinov98") "GitHub")
      ("n" (browse-url "https://www.netflix.com/") "Netflix")
      ("y" (browse-url "https://www.youtube.com/") "YouTube")
      ("m" (browse-url "https://www.messenger.com/") "Messenger")
      ("s" eshell "shell")
      ("a" ansi-term "ansi-term")
      ("q" nil "quit"))
  #+END_SRC
*** Writing (taking notes, and writing)
#+BEGIN_SRC emacs-lisp
     (defhydra hydra-writing (:color red :columns 2)
      "âœ“ Writing and Spelling âœ“"
      ("d" ispell-change-dictionary "change dict")
      ("s" ispell-word "spell word")
      ("f" flyspell-buffer "flyspell buffer")
      ("m" flyspell-mode "flyspell mode")
      ("r" flyspell-region "flyspell region")
      ("n" flyspell-goto-next-error "next error")
      ("w" writegood-mode "writegood mode")
      ("q" nil "quit"))
#+END_SRC
*** Utility (useful commands for me)
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-utility (:color red :columns 4)
   "ðŸ˜Ž Utility ðŸ˜Ž"
   ("m" goto-MarinMacs "goto config")
   ("b" gdb "gdb")
   ("e" eval-buffer "eval buffer")
   ("d" dap-debug "dap debug")
   ("i" dap-debug-edit-template "debug template")
   ("r" helm-recentf "recent files")
   ("g" helm-ag "ripgrep") ;; forced ag to use ripgrep
   ("l" helm-locate "locate")
   ("z" helm-find "fuzzy-find")
   ("f" flycheck-buffer "flycheck buffer")
   ("R" ranger "ranger")
   ("c" compile "compile")
   ("u" auto-fill-mode "auto-fill-mode")
   ("w" web-mode "web-mode")
   ("j" rjsx-mode "rjsx-mode")
   ("q" nil "quit"))
#+END_SRC
*** Org (for org mode)
    #+begin_src emacs-lisp
      (defun marinov/goto-org-directory ()
        "goes to my org directory"
        (interactive)
        (find-file org-directory))

      (defun marinov/jump-to-notes ()
        "go to notes file"
        (interactive)
        (find-file org-default-notes-file))

       (defhydra hydra-org (:color blue :columns 4)
        "ï‚© ORG ï‚©"
        ("o" org-open-at-point "open link")
        ("c" org-toggle-comment "comment")
        ("i" org-time-stamp "time stamp")
	("d" org-export-dispatch "export dispatch")
        ("p" org-priority "priority")
        ("t" org-todo "todo state")
        ("a" org-todo-list "agenda")
        ("l" org-show-todo-tree "show todo tree")
        ("s" org-edit-special "edit special")
        ("x" org-edit-src-exit "exit special")
        ("n" marinov/jump-to-notes "goto notes")
        ("D" marinov/goto-org-directory "goto org directory")
        ("q" nil "quit"))
    #+end_src
