emacs/alt-Configs/MarinMacsHelm.org
* LSP
 :PROPERTIES:
 :CUSTOM_ID: lsp
 :END:
 - LSP stands for Language Server Protocal and makes setting up autocompletion and syntax checking easy. 
 - Check the [[https://github.com/emacs-lsp/lsp-mode][Official Repo]] to see what to install for your preferred development language
 - lsp-ui (UI integrations for lsp-mode)
 - company-lsp (this is the company completion backend)
#+BEGIN_SRC emacs-lisp  
  (use-package lsp-mode
      :ensure t
      :diminish
      :commands lsp
      :hook
      ((c++-mode . lsp)
      (c-mode . lsp)
      (python-mode . lsp)
      (css-mode . lsp)
      (yaml-mode . lsp)
      (json-mode . lsp)
      (js2-mode . lsp)
      (rjsx-mode . lsp)
      (typescript-mode . lsp)
      (web-mode . lsp))
      :custom
      (lsp-idle-delay 0.15)
      (lsp-flycheck-live-reporting nil) ;; allows our previous flycheck setting to only check syntax on save to work
      :config
      (setq lsp-clients-clangd-args '("-j=4" "-background-index" "-log=error")))

  (use-package lsp-ui
      :after lsp-mode flycheck
      :ensure t
      :diminish
      :commands lsp-ui-mode
      :hook (lsp-mode . lsp-ui-mode)
      :bind
      (:map lsp-ui-peek-mode-map
      ("M-j" . lsp-ui-peek--select-next)
      ("M-k" . lsp-ui-peek--select-prev))
      :custom
      (lsp-ui-doc-enable t)
      (lsp-ui-doc-delay 0.65) ;; display doc after 6.5/10 of a second
      (lsp-ui-doc-use-childframe t)
      (lsp-ui-doc-position 'top)
      (lsp-ui-doc-include-signature t)
      (lsp-ui-sideline-enable nil)
      (lsp-ui-flycheck-list-position 'right)
      (lsp-ui-peek-enable t)
      (lsp-ui-peek-list-width 60)
      (lsp-ui-peek-peek-height 25)
      :config
      (setq eldoc-idle-delay 0.65)) ;; delay eldoc for 6.5/10 second

  (use-package company-lsp
      :requires company
      :ensure t
      :custom
      (company-transformers nil)
      (company-lsp-async t)
      (company-lsp-cache-candidates nil) ;; Disable client-side cache because the LSP server does a better job.
      (company-lsp-enable-snippet t)
      (company-lsp-enable-recompletion t)
      :config
      (push 'company-lsp company-backends))

#+END_SRC
* DAP
 :PROPERTIES:
 :CUSTOM_ID: dap
 :END:
- DAP stands for Debug Adapter Protocal works similiarly to LSP but for debugging
- Repo: https://github.com/emacs-lsp/dap-mode (includes everything you need to install for your desired development language)
#+BEGIN_SRC emacs-lisp
   ;; enable hydra bindings in dap mode
   (use-package dap-hydra
       :ensure nil
       :requires hydra)

   ;; only installing because dap-mode requires it
   (use-package posframe :ensure t)

   (use-package dap-mode
       :ensure t
       :requires hydra
       :hook
       (lsp-mode . (lambda () (dap-mode t) (dap-ui-mode t) (dap-tooltip-mode 1) (tooltip-mode 1)))
       :config
       (add-hook 'dap-stopped-hook
       (lambda (arg) (call-interactively #'dap-hydra)))) ;; enable hydra on breakpoint stop

#+END_SRC
* Latex 
 :PROPERTIES:
 :CUSTOM_ID: latex
 :END:
- I still actually prefer Overleaf for latex editing...Hoping to just use emacs for it one day
- I am also considering using org mode and then exporting to latex 
- Enable any if you wish, may be utilized in the future
- Below packages are kept for reference
  - tex (powerful text formatter)
  - auctex (extensible package for writing and formatting TeX files in Emacs)
  - pdf-tools (pdf utility in Emacs)
#+BEGIN_SRC emacs-lisp

  (use-package tex
     :disabled
     :ensure auctex
     :config
     (setq TeX-auto-save t)
     (setq TeX-parse-self t)
     (setq TeX-save-query nil))


  ;;;;;;;;;;;;;;;;;;
  ;; PDF
  ;;;;;;;;;;;;;;;;;;

  (use-package pdf-tools
      :disabled
      :ensure t)
#+END_SRC
* Development
 :PROPERTIES:
 :CUSTOM_ID: development
 :END:
** C-Cpp
 :PROPERTIES:
 :CUSTOM_ID: c-cpp
 :END:
- Clangd Language Server: https://clang.llvm.org/extra/clangd/Installation.html
- Cpp extras (mostly optional)
  - [[https://www.google.com/search?q=cmake&oq=cmake&aqs=chrome..69i57j0l6j69i65.645j0j4&client=ubuntu&sourceid=chrome&ie=UTF-8][Cmake]]
  - [[https://llvm.org/][llvm]]
  - [[https://clang.llvm.org/][Clang]]
*** Settings
#+BEGIN_SRC emacs-lisp
(setq-default c-basic-offset 4) ;; indentation for C-based languages

;; disable other checkers since we only want to utilize clangd language server
(setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc)) 

;; enable modern font lock for >=c++11
(use-package modern-cpp-font-lock
    :ensure t
    :config
    (modern-c++-font-lock-global-mode t))
#+END_SRC
*** Debugging
Still experimenting with this, native gdb in emacs is also really good 
#+BEGIN_SRC emacs-lisp
(use-package dap-gdb-lldb
  :ensure nil
  :requires dap-mode
  :config
  (dap-register-debug-template
  "GDB config"
  (list :type "gdb"
        :request "launch"
        :name "GDB::Run"
        :target "test"
        :program "test"
        :cwd "/home/marin/Projects")))

#+END_SRC
*** Clang-Format
 - The only package that utilizes quelpa at the moment :))
 - Formats your C++ code
 - Documentation: https://clang.llvm.org/docs/ClangFormat.html
 - You should also search how to install *clang-format* on your specific OS
#+BEGIN_SRC emacs-lisp
  (use-package clang-format 
     :ensure t
     :diminish
     :bind 
     (("C-c R" . clang-format-region) ;; format current line
     ("C-c F" . clang-format-buffer))) ;; format entire file
 
 ;; formats file on save
 (use-package clang-format+
     :quelpa (clang-format+
              :fetcher github
              :repo "SavchenkoValeriy/emacs-clang-format-plus")
              :config
              (add-hook 'c-mode-common-hook #'clang-format+-mode))
#+END_SRC
** Python
 :PROPERTIES:
 :CUSTOM_ID: python
 :END:
- Python-pip: https://pip.pypa.io/en/stable/
- Python Language Server: https://pypi.org/project/python-language-server/
pip installs (useful packages for python development) 
 #+BEGIN_SRC markdown
pip3 install rope jedi pylint flake8 autopep8 yapf pygments virtualenv virtualenvwrapper powerline-shell pynvim
 #+END_SRC
*** Settings
#+BEGIN_SRC emacs-lisp
  ;; version 
  (setq py-python-command "python3")
  (setq python-shell-interpreter "python3")

  ;; indentation
  (setq-default python-basic-offset 4) 
  (setq-default python-indent-offset 4) 
  (setq python-indent-guess-indent-offset t) ;; allow emacs to guess offset
  (setq python-indent-guess-indent-offset-verbose nil) ;; remove indent warning because we already set indents
  
  ;; warnings
  (setq lsp-pyls-plugins-pycodestyle-enabled nil) ;; comment if you want code style warnings everywhere
#+END_SRC
*** Debugging
Note: the template is meant to be edited to personal preferences
#+BEGIN_SRC emacs-lisp
(use-package dap-python
  :ensure nil
  :requires dap-mode
  :config
  (dap-register-debug-template "My App"
  (list :type "python"
        :args "-i"
        :cwd nil
        :env '(("DEBUG" . "1"))
        :target-module (expand-file-name "~/src/myapp/.env/bin/myapp")
        :request "launch"
        :name "My App")))
#+END_SRC
*** Elpy
 - No longer need it because of LSP but keeping it for reference
 - Documentation: https://elpy.readthedocs.io/en/latest/
#+BEGIN_SRC emacs-lisp
(use-package elpy
   :disabled
   :ensure t
   :config 
   (elpy-enable))
#+END_SRC
*** Virtualenv
 Remove disabled if you need it, I have yet to develop seriously in Python
#+BEGIN_SRC emacs-lisp
(use-package virtualenvwrapper
   :disabled
   :ensure t
   :config
   (venv-initialize-interactive-shells)
   (venv-initialize-eshell))
#+END_SRC
 :PROPERTIES:
 :CUSTOM_ID: python
 :END:
** Web-Development 
 :PROPERTIES:
 :CUSTOM_ID: web-development
 :END:
 Language servers install command (that I use): 
 #+BEGIN_SRC markdown
 npm i -g typescript-language-server vscode-json-languageserver vscode-html-languageserver-bin yaml-language-server vscode-css-languageserver-bin bash-language-server
 #+END_SRC
*** Web-Dev Essentials
 - Web-mode is an Autonomous emacs major-mode for editing web templates. 
 - Essential for web-development. Highlighting, auto-closing tags, just great.
 - Official Website: http://web-mode.org/
#+BEGIN_SRC emacs-lisp
  (use-package web-mode
      :ensure t
      :mode
      (("\\.html?\\'"      . web-mode)
      ("\\.phtml\\'"       . web-mode)
      ("\\.tpl\\.php\\'"   . web-mode)
      ("\\.blade\\.php\\'" . web-mode)
      ("\\.[agj]sp\\'"     . web-mode)
      ("\\.as[cp]x\\'"     . web-mode)
      ("\\.erb\\'"         . web-mode)
      ("\\.mustache\\'"    . web-mode)
      ("\\.djhtml\\'"      . web-mode)
      ("\\.js\\'"          . web-mode))
      :custom
      ;; Indentation
      (web-mode-attr-indent-offset 2)
      (web-mode-markup-indent-offset 2)
      (web-mode-code-indent-offset 2)
      (web-mode-css-indent-offset 2)
      ;; Auto-closing
      (web-mode-auto-close-style 2)
      (web-mode-enable-auto-pairing t)
      (web-mode-enable-auto-quoting t)
      ;; Highlighting
      (web-mode-enable-current-column-highlight t)
      (web-mode-enable-current-element-highlight t)
      :config
      (setq web-mode-enable-engine-detection t))

      (setq-default css-indent-offset 2) ;; web mode for some reason cancels css autocomplete so I have to configure css separately
#+END_SRC
visually display hex values as colors
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode 
      :ensure t
      :init 
      (rainbow-mode 1))
#+END_SRC
- This is what I like to use to format my code
- need to run 'npm i -g prettier' in order for this to work (Locally should work too)
#+BEGIN_SRC emacs-lisp
  (use-package prettier-js
      :ensure t
      :hook
      ((js-mode . prettier-js-mode)
      (js2-mode . prettier-js-mode)
      (web-mode . prettier-js-mode)
      (typescript-mode . prettier-js-mode)
      (rjsx-mode . prettier-js-mode)))
#+END_SRC
