emacs/backups/MarinMacsHelm.el

(use-package lsp-mode
    :ensure t
    :diminish
    :commands lsp
    :hook
    ((c++-mode . lsp)
    (c-mode . lsp)
    (python-mode . lsp)
    (css-mode . lsp)
    (yaml-mode . lsp)
    (json-mode . lsp)
    (js2-mode . lsp)
    (rjsx-mode . lsp)
    (typescript-mode . lsp)
    (web-mode . lsp))
    :custom
    (lsp-idle-delay 0.15)
    (lsp-flycheck-live-reporting nil) ;; allows our previous flycheck setting to only check syntax on save to work
    :config
    (setq lsp-clients-clangd-args '("-j=4" "-background-index" "-log=error")))

(use-package lsp-ui
    :after lsp-mode flycheck
    :ensure t
    :diminish
    :commands lsp-ui-mode
    :hook (lsp-mode . lsp-ui-mode)
    :bind
    (:map lsp-ui-peek-mode-map
    ("M-j" . lsp-ui-peek--select-next)
    ("M-k" . lsp-ui-peek--select-prev))
    :custom
    (lsp-ui-doc-enable t)
    (lsp-ui-doc-delay 0.65) ;; display doc after 6.5/10 of a second
    (lsp-ui-doc-use-childframe t)
    (lsp-ui-doc-position 'top)
    (lsp-ui-doc-include-signature t)
    (lsp-ui-sideline-enable nil)
    (lsp-ui-flycheck-list-position 'right)
    (lsp-ui-peek-enable t)
    (lsp-ui-peek-list-width 60)
    (lsp-ui-peek-peek-height 25)
    :config
    (setq eldoc-idle-delay 0.65)) ;; delay eldoc for 6.5/10 second

(use-package company-lsp
    :requires company
    :ensure t
    :custom
    (company-transformers nil)
    (company-lsp-async t)
    (company-lsp-cache-candidates nil) ;; Disable client-side cache because the LSP server does a better job.
    (company-lsp-enable-snippet t)
    (company-lsp-enable-recompletion t)
    :config
    (push 'company-lsp company-backends))

;; enable hydra bindings in dap mode
(use-package dap-hydra
    :ensure nil
    :requires hydra)

;; only installing because dap-mode requires it
(use-package posframe :ensure t)

(use-package dap-mode
    :ensure t
    :requires hydra
    :hook
    (lsp-mode . (lambda () (dap-mode t) (dap-ui-mode t) (dap-tooltip-mode 1) (tooltip-mode 1)))
    :config
    (add-hook 'dap-stopped-hook
    (lambda (arg) (call-interactively #'dap-hydra)))) ;; enable hydra on breakpoint stop

(use-package tex
   :disabled
   :ensure auctex
   :config
   (setq TeX-auto-save t)
   (setq TeX-parse-self t)
   (setq TeX-save-query nil))


;;;;;;;;;;;;;;;;;;
;; PDF
;;;;;;;;;;;;;;;;;;

(use-package pdf-tools
    :disabled
    :ensure t)

(setq-default c-basic-offset 4) ;; indentation for C-based languages

;; disable other checkers since we only want to utilize clangd language server
(setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc)) 

;; enable modern font lock for >=c++11
(use-package modern-cpp-font-lock
    :ensure t
    :config
    (modern-c++-font-lock-global-mode t))

(use-package dap-gdb-lldb
  :ensure nil
  :requires dap-mode
  :config
  (dap-register-debug-template
  "GDB config"
  (list :type "gdb"
        :request "launch"
        :name "GDB::Run"
        :target "test"
        :program "test"
        :cwd "/home/marin/Projects")))

(use-package clang-format 
    :ensure t
    :diminish
    :bind 
    (("C-c R" . clang-format-region) ;; format current line
    ("C-c F" . clang-format-buffer))) ;; format entire file

;; formats file on save
(use-package clang-format+
    :quelpa (clang-format+
             :fetcher github
             :repo "SavchenkoValeriy/emacs-clang-format-plus")
             :config
             (add-hook 'c-mode-common-hook #'clang-format+-mode))

;; version 
(setq py-python-command "python3")
(setq python-shell-interpreter "python3")

;; indentation
(setq-default python-basic-offset 4) 
(setq-default python-indent-offset 4) 
(setq python-indent-guess-indent-offset t) ;; allow emacs to guess offset
(setq python-indent-guess-indent-offset-verbose nil) ;; remove indent warning because we already set indents

;; warnings
(setq lsp-pyls-plugins-pycodestyle-enabled nil) ;; comment if you want code style warnings everywhere

(use-package dap-python
  :ensure nil
  :requires dap-mode
  :config
  (dap-register-debug-template "My App"
  (list :type "python"
        :args "-i"
        :cwd nil
        :env '(("DEBUG" . "1"))
        :target-module (expand-file-name "~/src/myapp/.env/bin/myapp")
        :request "launch"
        :name "My App")))

(use-package elpy
   :disabled
   :ensure t
   :config 
   (elpy-enable))

(use-package virtualenvwrapper
   :disabled
   :ensure t
   :config
   (venv-initialize-interactive-shells)
   (venv-initialize-eshell))

(use-package web-mode
    :ensure t
    :mode
    (("\\.html?\\'"      . web-mode)
    ("\\.phtml\\'"       . web-mode)
    ("\\.tpl\\.php\\'"   . web-mode)
    ("\\.blade\\.php\\'" . web-mode)
    ("\\.[agj]sp\\'"     . web-mode)
    ("\\.as[cp]x\\'"     . web-mode)
    ("\\.erb\\'"         . web-mode)
    ("\\.mustache\\'"    . web-mode)
    ("\\.djhtml\\'"      . web-mode)
    ("\\.js\\'"          . web-mode))
    :custom
    ;; Indentation
    (web-mode-attr-indent-offset 2)
    (web-mode-markup-indent-offset 2)
    (web-mode-code-indent-offset 2)
    (web-mode-css-indent-offset 2)
    ;; Auto-closing
    (web-mode-auto-close-style 2)
    (web-mode-enable-auto-pairing t)
    (web-mode-enable-auto-quoting t)
    ;; Highlighting
    (web-mode-enable-current-column-highlight t)
    (web-mode-enable-current-element-highlight t)
    :config
    (setq web-mode-enable-engine-detection t))

    (setq-default css-indent-offset 2) ;; web mode for some reason cancels css autocomplete so I have to configure css separately

(use-package rainbow-mode 
    :ensure t
    :init 
    (rainbow-mode 1))

(use-package prettier-js
    :ensure t
    :hook
    ((js-mode . prettier-js-mode)
    (js2-mode . prettier-js-mode)
    (web-mode . prettier-js-mode)
    (typescript-mode . prettier-js-mode)
    (rjsx-mode . prettier-js-mode)))
