emacs/alt-Configs/MarinMacsHelm.org
*** Modes
- These are modes related to web-dev that I have worked with 
- If you are a *react.js* developer, I *highly recommend* hooking *rjsx-mode* to *.js* files as well
  - if you are a *node.js* developer and/or *vanilla js* developer, I found the current setup with web mode to be better for syntax highlighting
  - in *hydra-marinov* located in the [[#hydra][Hydra]] section there are keybindings to switch between rjsx and web mode easily
#+BEGIN_SRC emacs-lisp
  (use-package rjsx-mode
      :ensure t
      :mode
      (("\\.jsx\\'"  . rjsx-mode))
      :init
      (setq-default rjsx-basic-offset 2))
    
  (use-package json-mode
      :ensure t
      :commands json-mode)

  (use-package yaml-mode
      :ensure t
      :commands yaml-mode
      :mode (("\\.yml\\'" . yaml-mode)
             ("\\.yaml\\'" . yaml-mode)))
             
  (use-package graphql-mode
      :ensure t
      :commands graphql-mode
      :mode
      (("\\.\\(gql\\|graphql\\)\\'" . graphql-mode)))
    
  (use-package dockerfile-mode 
      :ensure t
      :commands dockerfile-mode
      :mode
      (("Dockerfile'"       . dockerfile-mode)
      ("\\.Dockerfile\\'"  . dockerfile-mode)))
    
  (use-package csv-mode 
      :ensure t
      :commands csv-mode)
#+END_SRC
*** Skewer
'live web-development in emacs'
#+BEGIN_SRC emacs-lisp
  (use-package skewer-mode
      :disabled
      :ensure t
      :commands skewer-mode run-skewer
      :config
      (add-hook 'js2-mode-hook 'skewer-mode)
      (add-hook 'css-mode-hook 'skewer-css-mode)
      (add-hook 'html-mode-hook 'skewer-html-mode)
      (skewer-setup))
    
#+END_SRC
*** Impatient-Mode
'See the effect of your HTML as you type it.'
   #+BEGIN_SRC emacs-lisp
  (use-package impatient-mode
      :disabled
      :ensure t)  
   #+END_SRC
*** Emmet 
 More on emmet: https://www.emmet.io/
#+BEGIN_SRC emacs-lisp
  (use-package emmet-mode
      :ensure t
      :hook
      ((css-mode  . emmet-mode)
      (php-mode  . emmet-mode)
      (sgml-mode . emmet-mode)
      (rjsx-mode . emmet-mode)
      (web-mode  . emmet-mode)))
#+END_SRC
** JavaScript-TypeScript
 :PROPERTIES:
 :CUSTOM_ID: JavaScript-TypeScript
 :END:
- JavaScript/TypeScript language server: https://github.com/theia-ide/typescript-language-server
- Select =ts-ls= when prompted which server to install 
*** Node Path
Adds the node_modules/.bin directory to the buffer exec_path.
#+BEGIN_SRC emacs-lisp
  (use-package add-node-modules-path
      :ensure t
      :hook 
      ((web-mode . add-node-modules-path)
      (rjsx-mode . add-node-modules-path)))
#+END_SRC
*** Debugging
 Any kind of setup can be found in the dap repo that was mentioned previously...
*** Front-end
#+BEGIN_SRC emacs-lisp
  ;; debugging in chrome
  (use-package dap-chrome
      :ensure nil
      :requires dap-mode)
  
  ;; debugging in firefox
  (use-package dap-firefox
      :ensure nil
      :requires dap-mode)
#+END_SRC
*** Back-end
#+BEGIN_SRC emacs-lisp
  (use-package dap-node
      :ensure nil
      :requires dap-mode)
#+END_SRC
*** Js2-mode
- A 'better' mode for editing javascript files. Can have performance issues and errors 
- I am using web mode for js files now and it seems to be a bit better for syntax highlighting at least 
- Consider also using *js-mode* as it supports a lot more features in Emacs versions >= 27.05
- Repo to keep track of how the mode is doing: https://github.com/mooz/js2-mode
#+BEGIN_SRC emacs-lisp
  (use-package js2-mode
      :ensure t
      :config 
      (setq js2-strict-missing-semi-warning nil)
      (setq-default js2-basic-offset 2)) ;; set indentation to 2

#+END_SRC

 :PROPERTIES:
 :CUSTOM_ID: ts
 :END:
*** TIDE
All for typescript
#+BEGIN_SRC emacs-lisp
  ;; enable typescript in emacs
  (use-package typescript-mode
      :ensure t
      :mode (("\\.ts\\'" . typescript-mode)
             ("\\.tsx\\'" . typescript-mode))
      :config
      (setq-default typescript-indent-level 2)) ;; indent 2 spaces by default

  ;; typescript integrated development environment
  (use-package tide
      :ensure t
      :after
      (typescript-mode company flycheck)
      :hook
      ((typscript-mode . tide-setup)
      (typescript-mode . tide-hl-identifier-mode)
      (before-save . tide-format-before-save))
      :config
      (flycheck-add-next-checker 'typescript-tide 'javascript-eslint)
      (flycheck-add-next-checker 'tsx-tide 'javascript-eslint))
#+END_SRC
* Diminish
 :PROPERTIES:
 :CUSTOM_ID: diminish
 :END:
- This hides modes from your modeline, add the specific mode you do not want to see in the modeline
- Usually the =:diminish= keyword takes care of it, but some modes seem to only diminish if they are put here.
  #+begin_src emacs-lisp
    (use-package diminish
        :ensure t
        :init
        (diminish 'yas-minor-mode)
        (diminish 'modern-c++-font-lock-mode)
        (diminish 'auto-revert-mode)
        (diminish 'page-break-lines-mode)
        (diminish 'eldoc-mode)
        (diminish 'abbrev-mode))
  #+end_src
  
