emacs/backups/MarinMacsHelm.el

(use-package rjsx-mode
    :ensure t
    :mode
    (("\\.jsx\\'"  . rjsx-mode))
    :init
    (setq-default rjsx-basic-offset 2))

(use-package json-mode
    :ensure t
    :commands json-mode)

(use-package yaml-mode
    :ensure t
    :commands yaml-mode
    :mode (("\\.yml\\'" . yaml-mode)
           ("\\.yaml\\'" . yaml-mode)))

(use-package graphql-mode
    :ensure t
    :commands graphql-mode
    :mode
    (("\\.\\(gql\\|graphql\\)\\'" . graphql-mode)))

(use-package dockerfile-mode 
    :ensure t
    :commands dockerfile-mode
    :mode
    (("Dockerfile'"       . dockerfile-mode)
    ("\\.Dockerfile\\'"  . dockerfile-mode)))

(use-package csv-mode 
    :ensure t
    :commands csv-mode)

(use-package skewer-mode
    :disabled
    :ensure t
    :commands skewer-mode run-skewer
    :config
    (add-hook 'js2-mode-hook 'skewer-mode)
    (add-hook 'css-mode-hook 'skewer-css-mode)
    (add-hook 'html-mode-hook 'skewer-html-mode)
    (skewer-setup))

(use-package impatient-mode
    :disabled
    :ensure t)

(use-package emmet-mode
    :ensure t
    :hook
    ((css-mode  . emmet-mode)
    (php-mode  . emmet-mode)
    (sgml-mode . emmet-mode)
    (rjsx-mode . emmet-mode)
    (web-mode  . emmet-mode)))

(use-package add-node-modules-path
    :ensure t
    :hook 
    ((web-mode . add-node-modules-path)
    (rjsx-mode . add-node-modules-path)))

;; debugging in chrome
(use-package dap-chrome
    :ensure nil
    :requires dap-mode)

;; debugging in firefox
(use-package dap-firefox
    :ensure nil
    :requires dap-mode)

(use-package dap-node
    :ensure nil
    :requires dap-mode)

(use-package js2-mode
    :ensure t
    :config 
    (setq js2-strict-missing-semi-warning nil)
    (setq-default js2-basic-offset 2)) ;; set indentation to 2

;; enable typescript in emacs
(use-package typescript-mode
    :ensure t
    :mode (("\\.ts\\'" . typescript-mode)
           ("\\.tsx\\'" . typescript-mode))
    :config
    (setq-default typescript-indent-level 2)) ;; indent 2 spaces by default

;; typescript integrated development environment
(use-package tide
    :ensure t
    :after
    (typescript-mode company flycheck)
    :hook
    ((typscript-mode . tide-setup)
    (typescript-mode . tide-hl-identifier-mode)
    (before-save . tide-format-before-save))
    :config
    (flycheck-add-next-checker 'typescript-tide 'javascript-eslint)
    (flycheck-add-next-checker 'tsx-tide 'javascript-eslint))

(use-package diminish
    :ensure t
    :init
    (diminish 'yas-minor-mode)
    (diminish 'modern-c++-font-lock-mode)
    (diminish 'auto-revert-mode)
    (diminish 'page-break-lines-mode)
    (diminish 'eldoc-mode)
    (diminish 'abbrev-mode))
